{
  "title": "Comment pouvons-nous vous aider ?",
  "subtitle": "Choisissez un sujet pour trouver des réponses",
  "findAnswer": "Trouvez votre réponse",
  "support": "Support",
  "helpCenter": "Centre d'aide",
  "searchPlaceholder": "Rechercher des réponses...",
  "popularQuestions": "Questions populaires :",
  "typeQuestion": "Tapez votre question...",
  "ask": "Demander",
  "topics": "Sujets",
  "answer": "Réponse",
  "noResults": "Aucun résultat trouvé",
  "tryDifferent": "Essayez d'autres mots-clés ou",
  "contactSupport": "contactez le support",
  "clear": "Effacer",
  "popularTags": "Tags populaires :",
  "helpful": "Utile",
  "thanks": "Merci !",
  "botWelcome": "Bonjour ! Je suis là pour vous aider. Choisissez une question ci-dessous ou posez-moi n'importe quoi !",
  "botFallback": "Je ne suis pas sûr de cette question. Essayez de reformuler, ou contactez notre équipe support à support@example.com pour une aide personnalisée !",
  "jumpTo": "Aller à",
  "stillQuestions": "D'autres questions ?",
  "q1": "Comment commencer ?",
  "a1": "C'est facile ! Inscrivez-vous gratuitement, choisissez un modèle et vous serez opérationnel en moins de 2 minutes. Aucune carte bancaire requise.",
  "q2": "Y a-t-il un essai gratuit ?",
  "a2": "Oui ! Nous offrons un essai gratuit de 14 jours avec accès complet à toutes les fonctionnalités. Testez tout sans risque avant de vous engager.",
  "q3": "Que comprend le plan Pro ?",
  "a3": "Pro inclut des projets illimités, un support prioritaire, des analyses avancées, des domaines personnalisés, la collaboration d'équipe et l'accès API. Tout ce dont vous avez besoin pour évoluer.",
  "q4": "Puis-je annuler à tout moment ?",
  "a4": "Absolument. Pas de contrat, pas de frais cachés. Annulez depuis les paramètres de votre compte en un clic. Nous offrons aussi une garantie de remboursement de 30 jours.",
  "q5": "Avez-vous une API ?",
  "a5": "Oui ! Notre API REST vous donne un accès programmatique complet. Consultez docs.example.com pour les guides d'authentification, les endpoints et des exemples de code dans plusieurs langages.",
  "q6": "Mes données sont-elles sécurisées ?",
  "a6": "Nous utilisons un chiffrement AES-256 de niveau bancaire, une infrastructure certifiée SOC 2 Type II et sommes entièrement conformes au RGPD. La sécurité de vos données est notre priorité.",
  "q7": "Puis-je inviter mon équipe ?",
  "a7": "Bien sûr ! Invitez un nombre illimité de membres avec les plans Pro et Entreprise. Définissez des permissions granulaires (Admin, Éditeur, Lecteur) pour chaque membre.",
  "q8": "Comment réinitialiser mon mot de passe ?",
  "a8": "Cliquez sur « Mot de passe oublié » sur la page de connexion, entrez votre email et nous vous enverrons un lien de réinitialisation sécurisé. Le lien expire en 1 heure par sécurité.",
  "q9": "Quelles intégrations sont disponibles ?",
  "a9": "Plus de 50 intégrations dont Slack, GitHub, Figma, Notion, Zapier, Jira et bien d'autres. De nouvelles intégrations sont ajoutées chaque mois.",
  "q10": "Comment contacter le support ?",
  "a10": "Envoyez un email à support@example.com, utilisez le chat intégré ou planifiez un appel. Le temps de réponse moyen est inférieur à 4 heures.",
  "q11": "Y a-t-il une documentation ?",
  "a11": "Documentation complète sur docs.example.com avec tutoriels, guides, références API et vidéos explicatives.",
  "q12": "Puis-je exporter mes données ?",
  "a12": "Oui ! Exportez toutes vos données à tout moment en JSON, CSV ou PDF depuis Paramètres → Données → Exporter.",
  "q_create_project": "Comment créer mon premier projet ?",
  "a_create_project": "Cliquez sur « Nouveau projet » dans votre tableau de bord, choisissez un modèle ou partez de zéro, et suivez l'assistant de configuration. Vous serez opérationnel en moins de 2 minutes.",
  "q_sys_req": "Quels sont les prérequis système ?",
  "a_sys_req": "Nous sommes entièrement basés sur le web, tout ce dont vous avez besoin est un navigateur moderne (Chrome, Firefox, Safari ou Edge). Aucun téléchargement ni installation nécessaire.",
  "q_billing": "Comment fonctionne la facturation ?",
  "a_billing": "Nous facturons mensuellement ou annuellement selon votre plan. Les plans annuels vous font économiser 20 %. Vous pouvez upgrader, downgrader ou annuler à tout moment depuis vos paramètres.",
  "q_refund": "Puis-je obtenir un remboursement ?",
  "a_refund": "Nous offrons une garantie de remboursement de 30 jours sur tous les plans. Si vous n'êtes pas satisfait, contactez le support pour un remboursement complet — sans questions.",
  "q_team_discount": "Offrez-vous des réductions d'équipe ?",
  "a_team_discount": "Oui ! Les équipes de 5+ bénéficient de 15 % de réduction, et les équipes de 20+ de 25 % de réduction. Contactez notre équipe commerciale pour des tarifs entreprise personnalisés.",
  "q_delete_account": "Comment supprimer mon compte ?",
  "a_delete_account": "Allez dans Paramètres → Compte → Supprimer le compte. Vous aurez 30 jours pour changer d'avis avant que les données ne soient définitivement supprimées.",
  "q_features": "Quelles fonctionnalités sont incluses ?",
  "a_features": "Les fonctionnalités principales incluent la gestion de projet, la collaboration en temps réel, l'intégration du contrôle de version, l'automatisation du déploiement et l'analytique.",
  "q_customize": "Puis-je personnaliser mon espace de travail ?",
  "a_customize": "Absolument ! Personnalisez les thèmes, les mises en page, les raccourcis clavier et créez des workflows personnalisés adaptés aux besoins de votre équipe.",
  "q_offline": "Supportez-vous le mode hors ligne ?",
  "a_offline": "Oui, notre application de bureau supporte le mode hors ligne. Les modifications se synchronisent automatiquement lorsque vous êtes de nouveau en ligne.",
  "q_training": "Proposez-vous des formations ?",
  "a_training": "Oui ! Sessions d'intégration gratuites pour les équipes, plus des forfaits de formation premium pour les clients entreprise.",
  "cat_getting_started": "Pour commencer",
  "cat_getting_started_desc": "Nouveau ici ? Commencez par les bases",
  "cat_billing": "Facturation & Plans",
  "cat_billing_desc": "Tarifs, factures et mises à niveau",
  "cat_technical": "Technique",
  "cat_technical_desc": "Intégrations, APIs et configuration",
  "cat_account": "Compte",
  "cat_account_desc": "Connexion, équipes et permissions",
  "cat_features": "Fonctionnalités",
  "cat_support": "Support",
  "questionsCount": "{count} questions",
  "wasHelpful": "Cela vous a-t-il aidé ?",
  "yes": "Oui",
  "no": "Non",
  "selectQuestion": "Sélectionnez une question dans le menu",
  "stillNeedHelp": "Besoin d'aide ? Contactez-nous →",
  "backToCategories": "Retour aux catégories",
  "showingQuestions": "Affichage de {count} questions",
  "tags": {
    "basics": "Bases",
    "pricing": "Tarifs",
    "technical": "Technique",
    "account": "Compte",
    "support": "Support",
    "new": "Nouveau",
    "plans": "Plans",
    "billing": "Facturation",
    "developer": "Développeur",
    "integrations": "Intégrations",
    "security": "Sécurité",
    "team": "Équipe",
    "login": "Connexion",
    "help": "Aide",
    "docs": "Docs",
    "data": "Données"
  },
  "feedbackThanks": "Merci pour votre retour ! 💚",
  "minimal": {
    "general": {
      "title": "Général",
      "q1": "Qu'est-ce que ce produit ?",
      "a1": "Nous sommes une plateforme tout-en-un qui aide les équipes à construire, déployer et faire évoluer des applications web modernes. Considérez-nous comme votre super-pouvoir de développement.",
      "q2": "À qui s'adresse-t-il ?",
      "a2": "Développeurs, designers et équipes de toutes tailles — des fondateurs solo aux organisations d'entreprise. Tous ceux qui veulent livrer plus vite.",
      "q3": "Y a-t-il un plan gratuit ?",
      "a3": "Oui ! Notre offre gratuite inclut les fonctionnalités principales avec des limites généreuses. Parfait pour les projets personnels et pour démarrer.",
      "q4": "Puis-je demander une fonctionnalité ?",
      "a4": "Oui ! Nous adorons les retours de notre communauté. Visitez notre roadmap publique pour voter sur les fonctionnalités ou en proposer de nouvelles."
    },
    "pricing": {
      "title": "Tarifs & Facturation",
      "q1": "Combien cela coûte-t-il ?",
      "a1": "Les plans commencent à 29 $/mois pour les individuels. Les plans d'équipe commencent à 99 $/mois. Les tarifs entreprise sont personnalisés — contactez les ventes.",
      "q2": "Puis-je payer annuellement ?",
      "a2": "Oui ! La facturation annuelle vous fait économiser 20 %. C'est 2 mois gratuits par rapport à la facturation mensuelle.",
      "q3": "Quels modes de paiement acceptez-vous ?",
      "a3": "Nous acceptons toutes les cartes de crédit principales, PayPal et les virements bancaires pour les comptes entreprise.",
      "q4": "Y a-t-il une politique de remboursement ?",
      "a4": "Garantie de remboursement de 30 jours sur tous les plans. Si vous n'êtes pas satisfait, nous vous remboursons — sans questions."
    },
    "features": {
      "title": "Fonctionnalités & Capacités",
      "q1": "Quelles fonctionnalités sont incluses ?",
      "a1": "Les fonctionnalités principales incluent la gestion de projet, la collaboration en temps réel, l'intégration du contrôle de version, l'automatisation du déploiement et l'analytique.",
      "q2": "Avez-vous une API ?",
      "a2": "Oui ! Notre API REST vous donne un accès programmatique complet. L'API GraphQL arrive bientôt.",
      "q3": "Quelles intégrations sont disponibles ?",
      "a3": "Plus de 50 intégrations dont GitHub, GitLab, Slack, Figma, Notion, Jira, Linear et Zapier pour des workflows personnalisés.",
      "q4": "Est-ce responsive mobile ?",
      "a4": "Oui, chaque composant est entièrement responsive et testé sur tous les principaux appareils et tailles d'écran."
    },
    "security": {
      "title": "Sécurité & Confidentialité",
      "q1": "Mes données sont-elles sécurisées ?",
      "a1": "Absolument. Nous utilisons un chiffrement AES-256 au repos et en transit, avec certification SOC 2 Type II et des audits de sécurité réguliers.",
      "q2": "Êtes-vous conforme au RGPD ?",
      "a2": "Oui, nous sommes entièrement conformes au RGPD. Vous pouvez exporter ou supprimer vos données à tout moment depuis les paramètres de votre compte.",
      "q3": "Vendez-vous mes données ?",
      "a3": "Jamais. Vos données vous appartiennent. Nous ne vendons, ne partageons et ne monétisons vos données d'aucune manière.",
      "q4": "Où les données sont-elles stockées ?",
      "a4": "Nos données sont hébergées dans des centres de données sécurisés et redondants situés aux États-Unis et en UE. Vous pouvez choisir la résidence de vos données."
    }
  }
}
