{
  "title": "利用規約",
  "lastUpdated": "最終更新日：2026年2月",
  "description": "Astroglassサービスを利用するための利用規約をお読みください。",
  "sections": {
    "intro": {
      "title": "はじめに",
      "content": "Astroglassへようこそ！これらの利用規約は、Astroglassのウェブサイトの利用規則と規制を概説しています。このウェブサイトにアクセスすることにより、これらの利用規約に同意したものとみなします。このページに記載されているすべての利用規約に同意しない場合は、Astroglassの使用を継続しないでください。"
    },
    "license": {
      "title": "ライセンス",
      "content": "特に明記されていない限り、Astroglassおよびまたはそのライセンサーは、Astroglass上のすべての資料の知的財産権を所有しています。すべての知的財産権は留保されています。これらの利用規約に設定された制限に従って、個人の使用のためにAstroglassからこれにアクセスできます。"
    },
    "restrictions": {
      "title": "制限事項",
      "content": "あなたは特に以下のすべてを制限されています。ウェブサイトの資料を他のメディアで公開すること。ウェブサイトの資料を販売、サブライセンス、その他商業化すること。ウェブサイトの資料を公に実行または表示すること。このウェブサイトに損害を与える、または損害を与える可能性のある方法でこのウェブサイトを使用すること。"
    },
    "content": {
      "title": "あなたのコンテンツ",
      "content": "これらのウェブサイト標準利用規約において、「あなたのコンテンツ」とは、このウェブサイトに表示することを選択した音声、動画、テキスト、画像、またはその他の素材を意味します。あなたのコンテンツを表示することにより、あなたはAstroglassに対し、あらゆるメディアでそれを使用、複製、翻案、公開、翻訳、配布するための非独占的、世界的、取消不能のサブライセンス可能なライセンスを付与します。"
    },
    "privacy": {
      "title": "あなたのプライバシー",
      "content": "当社のプライバシーポリシーをお読みください。"
    },
    "warranties": {
      "title": "保証なし",
      "content": "このウェブサイトは「現状有姿」で提供され、欠陥を伴うものであり、Astroglassは、このウェブサイトまたはこのウェブサイトに含まれる素材に関連するいかなる表明または保証も行いません。"
    },
    "liability": {
      "title": "責任の制限",
      "content": "Astroglass、およびその役員、取締役、従業員はいかなる場合でも、契約上の責任であるかどうかにかかわらず、あなたのこのウェブサイトの利用から生じる、またはいかなる形でも関連する事柄について責任を負わないものとします。Astroglass、およびその役員、取締役、従業員は、あなたのこのウェブサイトの利用から生じる、またはいかなる形でも関連する間接的、結果的、または特別な責任について責任を負わないものとします。"
    },
    "indemnification": {
      "title": "補償",
      "content": "あなたはここに、これらの規約のいずれかの規定への違反に起因または関連して生じるあらゆる責任、費用、要求、訴訟原因、損害、および支出から、最大限の範囲でAstroglassを補償するものとします。"
    },
    "severability": {
      "title": "分離条項",
      "content": "これらの規約のいずれかの規定が適用される法律の下で無効であることが判明した場合でも、その規定はここに記載されている残りの規定に影響を与えることなく削除されます。"
    },
    "variation": {
      "title": "規約の変更",
      "content": "Astroglassは、適切と判断したときにいつでもこれらの規約を改訂することが許可されており、このウェブサイトを使用することにより、これらの規約を定期的に確認することが期待されます。"
    },
    "governing": {
      "title": "準拠法および管轄裁判所",
      "content": "これらの規約は、国または州の法律に準拠し、それに基づいて解釈され、あなたは、いかなる紛争の解決についても国に所在する州および連邦裁判所の非独占的管轄権に服するものとします。"
    }
  }
}
