{
  "title": "¿Cómo podemos ayudarle?",
  "subtitle": "Elija un tema para encontrar respuestas",
  "findAnswer": "Encuentre su respuesta",
  "support": "Soporte",
  "helpCenter": "Centro de ayuda",
  "searchPlaceholder": "Buscar respuestas...",
  "popularQuestions": "Preguntas populares:",
  "typeQuestion": "Escriba su pregunta...",
  "ask": "Preguntar",
  "topics": "Temas",
  "answer": "Respuesta",
  "noResults": "No se encontraron resultados",
  "tryDifferent": "Pruebe con otras palabras clave o",
  "contactSupport": "contacte al soporte",
  "clear": "Limpiar",
  "popularTags": "Etiquetas populares:",
  "helpful": "Útil",
  "thanks": "¡Gracias!",
  "botWelcome": "¡Hola! Estoy aquí para ayudarle. Elija una pregunta o pregúnteme lo que quiera.",
  "botFallback": "No estoy seguro de esa pregunta. Intente reformular, o contacte a nuestro equipo de soporte en support@example.com para ayuda personalizada.",
  "jumpTo": "Ir a",
  "stillQuestions": "¿Más preguntas?",
  "q1": "¿Cómo empiezo?",
  "a1": "¡Es fácil! Regístrese gratis, elija una plantilla y estará operativo en menos de 2 minutos. No se requiere tarjeta de crédito.",
  "q2": "¿Hay una prueba gratuita?",
  "a2": "¡Sí! Ofrecemos una prueba gratuita de 14 días con acceso completo a todas las funciones. Pruebe todo sin riesgo antes de comprometerse.",
  "q3": "¿Qué incluye el plan Pro?",
  "a3": "Pro incluye proyectos ilimitados, soporte prioritario, analítica avanzada, dominios personalizados, colaboración en equipo y acceso API. Todo lo que necesita para crecer.",
  "q4": "¿Puedo cancelar en cualquier momento?",
  "a4": "Absolutamente. Sin contratos, sin cargos ocultos. Cancele desde la configuración de su cuenta con un clic. También ofrecemos garantía de devolución de 30 días.",
  "q5": "¿Tienen una API?",
  "a5": "¡Sí! Nuestra API REST le da acceso programático completo. Consulte docs.example.com para guías de autenticación, endpoints y ejemplos de código en múltiples lenguajes.",
  "q6": "¿Están seguros mis datos?",
  "a6": "Usamos cifrado AES-256 de nivel bancario, infraestructura certificada SOC 2 Tipo II y somos totalmente conformes con GDPR. La seguridad de sus datos es nuestra prioridad.",
  "q7": "¿Puedo invitar a mi equipo?",
  "a7": "¡Por supuesto! Invite miembros ilimitados con los planes Pro y Empresa. Establezca permisos granulares (Admin, Editor, Lector) para cada miembro.",
  "q8": "¿Cómo restablezco mi contraseña?",
  "a8": "Haga clic en «Olvidé mi contraseña» en la página de inicio de sesión, ingrese su email y le enviaremos un enlace de restablecimiento seguro. El enlace expira en 1 hora por seguridad.",
  "q9": "¿Qué integraciones están disponibles?",
  "a9": "Más de 50 integraciones incluyendo Slack, GitHub, Figma, Notion, Zapier, Jira y más. Se agregan nuevas integraciones mensualmente.",
  "q10": "¿Cómo contacto al soporte?",
  "a10": "Envíe un email a support@example.com, use el chat integrado o programe una llamada. El tiempo de respuesta promedio es menos de 4 horas.",
  "q11": "¿Hay documentación?",
  "a11": "Documentación completa en docs.example.com con tutoriales, guías, referencias API y videos explicativos.",
  "q12": "¿Puedo exportar mis datos?",
  "a12": "¡Sí! Exporte todos sus datos en cualquier momento en JSON, CSV o PDF desde Configuración → Datos → Exportar.",
  "q_create_project": "¿Cómo creo mi primer proyecto?",
  "a_create_project": "Haga clic en «Nuevo proyecto» en su panel, elija una plantilla o comience desde cero, y siga el asistente de configuración. Estará operativo en menos de 2 minutos.",
  "q_sys_req": "¿Cuáles son los requisitos del sistema?",
  "a_sys_req": "Somos completamente basados en web, solo necesita un navegador moderno (Chrome, Firefox, Safari o Edge). No se requieren descargas ni instalaciones.",
  "q_billing": "¿Cómo funciona la facturación?",
  "a_billing": "Facturamos mensual o anualmente según su plan. Los planes anuales le ahorran un 20 %. Puede actualizar, degradar o cancelar en cualquier momento desde su configuración.",
  "q_refund": "¿Puedo obtener un reembolso?",
  "a_refund": "Ofrecemos una garantía de devolución de 30 días en todos los planes. Si no está satisfecho, contacte al soporte para un reembolso completo — sin preguntas.",
  "q_team_discount": "¿Ofrecen descuentos de equipo?",
  "a_team_discount": "¡Sí! Equipos de 5+ obtienen 15 % de descuento, y equipos de 20+ obtienen 25 %. Contacte a nuestro equipo de ventas para precios empresariales personalizados.",
  "q_delete_account": "¿Cómo elimino mi cuenta?",
  "a_delete_account": "Vaya a Configuración → Cuenta → Eliminar cuenta. Tendrá 30 días para cambiar de opinión antes de que los datos se eliminen permanentemente.",
  "q_features": "¿Qué funciones están incluidas?",
  "a_features": "Las funciones principales incluyen gestión de proyectos, colaboración en tiempo real, integración de control de versiones, automatización de despliegue y analítica.",
  "q_customize": "¿Puedo personalizar mi espacio de trabajo?",
  "a_customize": "¡Absolutamente! Personalice temas, diseños, atajos de teclado y cree flujos de trabajo personalizados adaptados a las necesidades de su equipo.",
  "q_offline": "¿Soportan modo sin conexión?",
  "a_offline": "Sí, nuestra app de escritorio soporta modo sin conexión. Los cambios se sincronizan automáticamente cuando vuelve a estar en línea.",
  "q_training": "¿Ofrecen capacitación?",
  "a_training": "¡Sí! Sesiones de incorporación gratuitas para equipos, más paquetes de capacitación premium para clientes empresariales.",
  "cat_getting_started": "Primeros pasos",
  "cat_getting_started_desc": "¿Nuevo aquí? Empiece por lo básico",
  "cat_billing": "Facturación y Planes",
  "cat_billing_desc": "Precios, facturas y mejoras",
  "cat_technical": "Técnico",
  "cat_technical_desc": "Integraciones, APIs y configuración",
  "cat_account": "Cuenta",
  "cat_account_desc": "Inicio de sesión, equipos y permisos",
  "cat_features": "Funciones",
  "cat_support": "Soporte",
  "questionsCount": "{count} preguntas",
  "wasHelpful": "¿Le fue útil?",
  "yes": "Sí",
  "no": "No",
  "selectQuestion": "Seleccione una pregunta del menú",
  "stillNeedHelp": "¿Necesita más ayuda? Contáctenos →",
  "backToCategories": "Volver a categorías",
  "showingQuestions": "Mostrando {count} preguntas",
  "tags": {
    "basics": "Básicos",
    "pricing": "Precios",
    "technical": "Técnico",
    "account": "Cuenta",
    "support": "Soporte",
    "new": "Nuevo",
    "plans": "Planes",
    "billing": "Facturación",
    "developer": "Desarrollador",
    "integrations": "Integraciones",
    "security": "Seguridad",
    "team": "Equipo",
    "login": "Inicio de sesión",
    "help": "Ayuda",
    "docs": "Docs",
    "data": "Datos"
  },
  "feedbackThanks": "¡Gracias por su opinión! 💚",
  "minimal": {
    "general": {
      "title": "General",
      "q1": "¿Qué es este producto?",
      "a1": "Somos una plataforma todo-en-uno que ayuda a los equipos a construir, desplegar y escalar aplicaciones web modernas. Piense en nosotros como su superpoder de desarrollo.",
      "q2": "¿Para quién es?",
      "a2": "Desarrolladores, diseñadores y equipos de todos los tamaños — desde fundadores individuales hasta organizaciones empresariales. Cualquiera que quiera entregar más rápido.",
      "q3": "¿Hay un plan gratuito?",
      "a3": "¡Sí! Nuestro nivel gratuito incluye funciones principales con límites generosos. Perfecto para proyectos personales y para empezar.",
      "q4": "¿Puedo solicitar una función?",
      "a4": "¡Sí! Nos encanta recibir opiniones de nuestra comunidad. Visite nuestra hoja de ruta pública para votar funciones o sugerir nuevas."
    },
    "pricing": {
      "title": "Precios y Facturación",
      "q1": "¿Cuánto cuesta?",
      "a1": "Los planes comienzan en $29/mes para individuales. Los planes de equipo comienzan en $99/mes. Precios empresariales personalizados — contacte ventas.",
      "q2": "¿Puedo pagar anualmente?",
      "a2": "¡Sí! La facturación anual le ahorra un 20 %. Son 2 meses gratis comparado con la facturación mensual.",
      "q3": "¿Qué métodos de pago aceptan?",
      "a3": "Aceptamos todas las tarjetas de crédito principales, PayPal y transferencias bancarias para cuentas empresariales.",
      "q4": "¿Hay política de reembolso?",
      "a4": "Garantía de devolución de 30 días en todos los planes. Si no está satisfecho, le reembolsamos — sin preguntas."
    },
    "features": {
      "title": "Funciones y Capacidades",
      "q1": "¿Qué funciones están incluidas?",
      "a1": "Las funciones principales incluyen gestión de proyectos, colaboración en tiempo real, integración de control de versiones, automatización de despliegue y analítica.",
      "q2": "¿Tienen una API?",
      "a2": "¡Sí! Nuestra API REST le da acceso programático completo. La API GraphQL llegará pronto.",
      "q3": "¿Qué integraciones están disponibles?",
      "a3": "Más de 50 integraciones incluyendo GitHub, GitLab, Slack, Figma, Notion, Jira, Linear y Zapier para flujos de trabajo personalizados.",
      "q4": "¿Es responsive para móviles?",
      "a4": "Sí, cada componente es completamente responsive y está probado en todos los principales dispositivos y tamaños de pantalla."
    },
    "security": {
      "title": "Seguridad y Privacidad",
      "q1": "¿Están seguros mis datos?",
      "a1": "Absolutamente. Usamos cifrado AES-256 en reposo y en tránsito, con certificación SOC 2 Tipo II y auditorías de seguridad regulares.",
      "q2": "¿Son conformes con GDPR?",
      "a2": "Sí, somos totalmente conformes con GDPR. Puede exportar o eliminar sus datos en cualquier momento desde la configuración de su cuenta.",
      "q3": "¿Venden mis datos?",
      "a3": "Nunca. Sus datos son suyos. No vendemos, compartimos ni monetizamos sus datos de ninguna manera.",
      "q4": "¿Dónde se almacenan los datos?",
      "a4": "Nuestros datos se alojan en centros de datos seguros y redundantes ubicados en EE.UU. y la UE. Puede elegir la residencia de sus datos."
    }
  }
}
