{
  "pageTitle": "Біздің жұмыстар",
  "pageSubtitle": "Дәлдікпен, тереңдікпен және жеңіл өзара әрекеттесумен жасалған цифрлық тәжірибелер жиынтығы.",
  "backToHome": "Басты бетке оралу",
  "filterAll": "Барлығы",
  "viewDetails": "Толық ақпаратты көру",
  "closeDetails": "Жабу",
  "theChallenge": "Мәселе",
  "theSolution": "Шешім",
  "theImpact": "Нәтижесі",
  "techStackLabel": "Технологиялар",
  "startProject": "Жобаңызды бастау",
  "startProjectSub": "Идеяңызды жүзеге асыруға дайынсыз ба?",
  "comingSoon": "Бұл портфолио беті жақын арада қосылады.",
  "projects": {
    "p1": {
      "title": "Цифрлық экожүйе",
      "description": "Қарқынды дамып келе жатқан заманауи стартаптарға арналған кешенді шешім.",
      "longDescription": "Клиенттермен өзара әрекеттесуді, аналитика мен операциялық іс-шараларды бір қарапайым интерфейске біріктіретін толық стекті цифрлық платформа. Жоғары жылдамдықта анықтықты талап ететін, өсіп келе жатқан компаниялар (scale-ups) үшін жасалған.",
      "category": "Веб-қосымша",
      "challenge": "Клиент 12 түрлі құралды әрқайсысының мамандандырылған функционалдығын жоғалтпай, бір біртұтас платформаға біріктіруі қажет болды.",
      "solution": "Күрделі жұмыс процестерін жеңілдететін органикалық UI-ге оралған, нақты уақыттағы деректерді үндестіруі (сихронизациясы) бар микро-фронтенд модульдік жүйесін құрдық.",
      "impact": "Операциялық шығындарды 60%-ға азайттық және жобаны іске асырған алғашқы үш айда команданың өнімділігін 3 есеге арттырдық.",
      "techStack": ["React", "Node.js", "GraphQL", "Redis", "AWS"],
      "metric": "3x",
      "metricLabel": "Жылдамдық артуы"
    },
    "p2": {
      "title": "Сұйық басқару тақтасы",
      "description": "Терең иммерсивті зерттеуі бар деректер аналитикасы.",
      "longDescription": "Нәтижесінде алынған шикі деректерді сұйық әрі интерактивті визуалдауға айналдыратын аналитикалық басқару тақтасы. Қолданушылар жаңа аумақты зерттеп жүрген саяхатшылардай деректермен өзара әрекеттеседі.",
      "category": "Басқару тақтасы",
      "challenge": "Дәстүрлі басқару тақталары статикалық диаграммалармен және кестелермен қолданушыларды қиындататын. Клиент деректермен жұмыстың қарапайым әрі қызықты болғанын қалады.",
      "solution": "Қолданушының мінез-құлқына бейімделетін және ақпаратты белсенді түрде ұсынатын бейімделгіш дизайнмен, қимылмен басқарылатын (gesture-driven) сұйық деректерді визуалдауды жасадық.",
      "impact": "Қолданушылардың аналитиканы пайдалану белсенділігі 240%-ға артты, ал инсайттар алудың орташа уақыты 15 минуттан 3 минуттан аз уақытқа дейін қысқарды.",
      "techStack": ["Vue.js", "D3.js", "Python", "PostgreSQL", "Docker"],
      "metric": "50K+",
      "metricLabel": "Белсенді қолданушылар"
    },
    "p3": {
      "title": "Glassic Mobile",
      "description": "Мобильді интерфейстердің келесі буынын анықтау.",
      "longDescription": "Мобильді қосымшалар не бере алатындығының шекарасын кеңейтетін ұялы құрылғыға бағытталған (mobile-first) тәжірибе. Тереңдік, мөлдірлік пен қозғалыс бірігіп, бейне-бір «демалып» тұрған интерфейс жасайды.",
      "category": "Мобильді",
      "challenge": "Бұрынғы қосымша ескірген және ыңғайсыз болды. Қолданушылар интерфейстің тым күрделі болғанынан оны орнату процесі барысында өшіріп тастайтын.",
      "solution": "Бүкіл UX-ті глассморфизм дизайн жүйесімен, тактильді кері байланыспен (haptic feedback) және жүйені қарапайым, бірақ тартымдырақ ету үшін прогрессивті ашу (progressive disclosure) әдісімен қайта құрдық.",
      "impact": "App Store рейтингі 3.2-ден 4.9 жұлдызға көтерілді, ал тіркелу мен орнату процесін аяқтау деңгейі 85%-ға өсті.",
      "techStack": ["Swift", "SwiftUI", "Firebase", "Lottie", "CoreData"],
      "metric": "4.9★",
      "metricLabel": "App Store рейтингі"
    },
    "p4": {
      "title": "Кванттық желі (Quantum Web)",
      "description": "Шындық пен интерфейс арасындағы шекараны бұлдырату.",
      "longDescription": "2D экранда 3D тәжірибесін жасау үшін заманауи анимациялар мен кеңістіктік дизайнды қолданатын эксперименттік веб-платформа.",
      "category": "Брендинг",
      "challenge": "Бренд кез келген шолғыштан (браузерден) қол жетімді және олардың физикалық дүкендері сияқты премиум және иммерсивті цифрлық кеңістікті қажет етті.",
      "solution": "WebGL-ді, айналдыруға негізделген анимацияларды және құрылғының бағдары мен қолданушының жақындығына байланысты өзгеретін кеңістіктік веб-тәжірибені жасау үшін арнаулы шейдерлерді қолдандық.",
      "impact": "Брендтің танымалдылығы 200%-ға артты, орташа сессия ұзақтығы 3 есе өсті және сайт Awwwards-тан 3 «Күннің үздік сайты» марапатын жеңіп алды.",
      "techStack": ["Three.js", "GSAP", "WebGL", "Astro", "Cloudflare"],
      "metric": "200%",
      "metricLabel": "Белсенділік өсуі"
    },
    "p5": {
      "title": "Neural Flow",
      "description": "Креативті командаларға арналған жасанды интеллект қолдайтын автоматтандырылған жұмыс процесі.",
      "longDescription": "Креативті командалардың жұмыс процестерін үйренетін және қайталанатын тапсыру (handoffs), тексеру және файлдарды басқаруды автоматтандыратын зиятты платформа. Бұл дизайнерлерге негізгі жұмысқа көңіл бөлуге мүмкіндік береді.",
      "category": "Веб-қосымша",
      "challenge": "Креативті агенттіктер өздерінің төленетін (billable) жұмыс уақытының 30%-ын жобаларды басқаруға, файлдар нұсқаларының қақтығыстарына (conflicts) және бекіту процестеріне жоғалтатын.",
      "solution": "Жұмыстардың өзара тәуелділігін болжайтын, бекітулерді (approvals) автоматты түрде бағыттайтын және файлдың қай нұсқасы екенін көрнекі түрде көрсететін (visual diff) ЖИ деңгейін жасадық — барлығы қарапайым және көңіл бөлмейтін интерфейспен құрылды.",
      "impact": "Командалар әр дизайнерге аптасына орта есеппен 12 сағатты үнемдеді, ал жобаны аяқтау мерзімі 40%-ға қысқарды.",
      "techStack": ["Next.js", "OpenAI", "Prisma", "Supabase", "Vercel"],
      "metric": "40%",
      "metricLabel": "Лезде жеткізу"
    },
    "p6": {
      "title": "Prism Commerce",
      "description": "Иммерсивті өнімді зерттеуі бар келесі буын (Next-Gen) электронды коммерциясы.",
      "longDescription": "3D алдын ала қарау, AR (толықтырылған шынайылық) өлшеу және шолу мінез-құлқына негізделіп нақты уақытта жекеленетін бейімді онлайн-дүкендерде өнімдер өмірге келетін headless (үздіксіз) коммерциялық платформа.",
      "category": "Басқару тақтасы",
      "challenge": "Сатып алуға көндіру (конверсия) деңгейі 2.1%-да тұрып қалды. Клиенттер өнімді қолмен ұстап көре алмағандықтан, премиум тауарларды сатып алуда сенімсіздік танытты.",
      "solution": "WebXR арқылы өнімді алдын ала қарау мүмкіндігін, нақты уақыттағы жекелендіруді (personalization) және клиентке сатып алу қадамдарын жеңілдететін бір рет басумен рәсімделетін төлем (one-tap checkout) процесін біріктірдік.",
      "impact": "Сатып алу конверсиясы 5.8%-ға көтерілді, орташа чек (AOV) 35%-ға өсті, ал тауарларды қайтару деңгейі жартысына дейін қысқарды.",
      "techStack": ["Remix", "Shopify Hydrogen", "Three.js", "Stripe", "Edge Functions"],
      "metric": "176%",
      "metricLabel": "Сатылымның көтерілуі"
    }
  }
}
