{
  "title": "Құпиялылық саясаты",
  "lastUpdated": "Соңғы жаңарту: Ақпан 2026",
  "description": "Astroglass-та деректеріңізді қалай жинайтынымыз, пайдаланатынымыз және қорғайтынымыз туралы біліңіз.",
  "sections": {
    "intro": {
      "content": "Astroglass-қа қош келдіңіз. Біз сіздің құпиялылығыңызды құрметтейміз және сіздің жеке деректеріңізді қорғауға міндеттенеміз. Бұл құпиялылық саясаты веб-сайтымызға кірген кезде жеке деректеріңізге қалай қарайтынымыз туралы хабарлайды және құпиялылық құқықтарыңыз бен заңның сізді қалай қорғайтыны туралы айтып береді."
    },
    "collection": {
      "title": "Біз жинайтын ақпарат",
      "content": "Біз сіз туралы әртүрлі жеке деректерді жинай, пайдалана, сақтай және тасымалдай аламыз. Оларды келесідей топтастырдық: Жеке басты куәландыратын деректер, Байланыс деректері, Техникалық деректер және Пайдалану деректері. Біз сіз туралы ерекше санаттағы жеке деректерді жинамаймыз."
    },
    "usage": {
      "title": "Ақпаратыңызды қалай пайдаланамыз",
      "content": "Біз жеке деректеріңізді заң рұқсат еткен жағдайда ғана пайдаланамыз. Әдетте, біз сіздің жеке деректеріңізді келесі жағдайларда пайдаланамыз: Біз сізбен жасасатын немесе жасасқан келісімшартты орындау қажет болған жағдайда. Бұл біздің заңды мүдделеріміз (немесе үшінші тараптың) үшін қажет болған кезде және сіздің мүдделеріңіз бен негізгі құқықтарыңыз сол мүдделерден басым болмаған жағдайда."
    },
    "sharing": {
      "title": "Жеке деректеріңізді жариялау",
      "content": "Біз сіздің жеке деректеріңізді жоғарыдағы кестеде көрсетілген мақсаттар үшін төменде көрсетілген тараптармен бөлісе аламыз. Ішкі үшінші тараптар, Сыртқы үшінші тараптар (Cloudflare сияқты) және біз бизнесіміздің немесе активтеріміздің бөліктерін сатуды, тасымалдауды немесе біріктіруді таңдай алатын үшінші тараптар."
    },
    "security": {
      "title": "Деректер қауіпсіздігі",
      "content": "Біз сіздің жеке деректеріңіздің кездейсоқ жоғалуына, рұқсатсыз жолмен пайдаланылуына немесе ашылуына, өзгертілуіне немесе жариялануына жол бермеу үшін тиісті қауіпсіздік шараларын қабылдадық. Оған қоса, біз сіздің жеке деректеріңізге тек бизнес үшін білуі қажет қызметкерлер, агенттер, мердігерлер және басқа үшінші тараптар үшін ғана қолжетімділікті шектейміз."
    },
    "cookies": {
      "title": "Куки (Cookies)",
      "content": "Сіз браузеріңізді барлық немесе кейбір браузер кукилерінен бас тартуға немесе веб-сайттар кукилерді орнатқан немесе оларға қол жеткізген кезде сізге ескертуге орната аласыз. Егер сіз кукилерді өшірсеңіз немесе олардан бас тартсаңыз, бұл веб-сайттың кейбір бөліктері жұмыс істемеуі немесе дұрыс жұмыс істемеуі мүмкін екенін ескеріңіз."
    },
    "rights": {
      "title": "Заңды құқықтарыңыз",
      "content": "Кейбір жағдайларда, сізде жеке деректеріңізге қатысты деректерді қорғау заңдарына сәйкес құқықтарыңыз бар, оның ішінде рұқсат сұрау, түзету, жою, шектеу, тасымалдау, өңдеуге қарсылық білдіру, деректерді тасымалдамалы ету және (өңдеудің заңды негізі келісім болған кезде) келісімді қайтарып алу құқығы."
    },
    "contact": {
      "title": "Бізбен байланысу",
      "content": "Осы құпиялылық саясаты немесе біздің құпиялылық тәжірибеміз туралы сұрақтарыңыз болса, бізге хабарласыңыз: support@example.com."
    }
  }
}
