{
  "title": "Шарттар мен ережелер",
  "lastUpdated": "Соңғы жаңарту: Ақпан 2026",
  "description": "Astroglass қызметтерін пайдалану шарттары мен ережелерін оқыңыз.",
  "sections": {
    "intro": {
      "title": "Кіріспе",
      "content": "Astroglass-қа қош келдіңіз! Бұл шарттар мен ережелер Astroglass веб-сайтын пайдалану ережелері мен талаптарын сипаттайды. Осы веб-сайтқа кіру арқылы біз сізді осы шарттар мен ережелерді қабылдайды деп есептейміз. Егер осы бетте көрсетілген барлық шарттар мен ережелерді қабылдаумен келіспесеңіз, Astroglass қызметін пайдалануды жалғастырмаңыз."
    },
    "license": {
      "title": "Лицензия",
      "content": "Егер басқаша көрсетілмесе, Astroglass және/немесе оның лицензиарлары Astroglass-тағы барлық материалдарға зияткерлік меншік құқығына ие. Барлық зияткерлік меншік құқықтары қорғалған. Сіз бұған осы шарттарда белгіленген шектеулермен жеке пайдалану үшін қол жеткізе аласыз."
    },
    "restrictions": {
      "title": "Шектеулер",
      "content": "Сізге мыналардың барлығын жасауға қатаң тыйым салынады: кез келген веб-сайт материалын кез келген басқа медиада жариялау; кез келген веб-сайт материалын сату, қосалқы лицензиялау және/немесе басқаша коммерцияландыру; кез келген веб-сайт материалын көпшілік алдында көрсету және/немесе орындау; бұл веб-сайтты оған зиян келтіретін немесе тигізуі мүмкін кез келген тәсілмен пайдалану."
    },
    "content": {
      "title": "Сіздің мазмұныңыз",
      "content": "Осы веб-сайттың стандартты шарттарында «Сіздің мазмұныңыз» осы веб-сайтта көрсетуді таңдаған кез келген аудио, бейне, мәтін, суреттер немесе басқа материалды білдіреді. Сіздің мазмұныңызды көрсету арқылы сіз Astroglass-қа оны кез келген және барлық медиада пайдалануға, көбейтуге, бейімдеуге, жариялауға, аударуға және таратуға эксклюзивті емес, дүниежүзілік қайтарымсыз, қосалқы лицензияланатын лицензия бересіз."
    },
    "privacy": {
      "title": "Сіздің құпиялылығыңыз",
      "content": "Біздің Құпиялылық саясатымызды оқып шығыңыз."
    },
    "warranties": {
      "title": "Кепілдік жоқ",
      "content": "Бұл веб-сайт «қандай болса солай» барлық кемшіліктерімен ұсынылады, және Astroglass осы веб-сайтқа немесе осы веб-сайтта қамтылған материалдарға қатысты ешқандай мәлімдемелер немесе кез келген түрдегі кепілдіктер бермейді."
    },
    "liability": {
      "title": "Жауапкершілікті шектеу",
      "content": "Ешқандай жағдайда Astroglass, оның басшылығы, директорлары мен қызметкерлері осы веб-сайтты пайдаланумен байланысты немесе содан туындайтын (бұл жауапкершілік келісімшарт бойынша болса да) ештеңеге жауапты болмайды. Astroglass, соның ішінде оның басшылығы, директорлары мен қызметкерлері сіздің осы веб-сайтты пайдалануыңыздан немесе соған байланысты кез келген жанама, салдарлы немесе арнайы жауапкершілікке жауапты болмайды."
    },
    "indemnification": {
      "title": "Өтемақы",
      "content": "Осы арқылы сіз Astroglass-ты осы шарттардың кез келген ережелерін бұзуыңызға байланысты туындайтын кез келген және/немесе барлық міндеттемелерден, шығындардан, талаптардан, талап-арыздардан, зияндар мен төлемдерден барынша толық көлемде өтейсіз."
    },
    "severability": {
      "title": "Ажыратылуы",
      "content": "Егер осы шарттардың қандай да бір ережесі қолданыстағы заңнамаға сәйкес жарамсыз деп танылса, мұндай ережелер осында қамтылған қалған ережелерге әсер етпестен жойылады."
    },
    "variation": {
      "title": "Шарттардың өзгеруі",
      "content": "Astroglass-қа осы шарттарды кез келген уақытта өз қалауы бойынша қайта қарауға рұқсат етіледі, және сіз бұл веб-сайтты пайдалану арқылы осы шарттарды жүйелі түрде қарап отырасыз деп күтілуде."
    },
    "governing": {
      "title": "Қолданылатын құқық және юрисдикция",
      "content": "Бұл шарттар Мемлекеттік немесе Ел заңдарына сәйкес реттеледі және түсіндіріледі, және сіз кез келген дауларды шешу үшін Елде орналасқан штаттық және федералдық соттардың эксклюзивті емес юрисдикциясына бағынасыз."
    }
  }
}
