{
  "pageTitle": "我们的作品",
  "pageSubtitle": "一个经过精心策划的数字体验合集。每一个细节，不论是精确性、深度还是互动的流畅感，都经得起推敲验证。",
  "backToHome": "返回首页",
  "filterAll": "全部",
  "viewDetails": "查看详情",
  "closeDetails": "关闭",
  "theChallenge": "挑战点",
  "theSolution": "我们的解决方案",
  "theImpact": "最终展现的影响力",
  "techStackLabel": "技术栈",
  "startProject": "开始你的项目",
  "startProjectSub": "准备好将你的愿景变为现实了吗？",
  "comingSoon": "此作品集页面即将在未来到来。",
  "projects": {
    "p1": {
      "title": "数字生态系统",
      "description": "为具备要求严格特质的高增长型现代初创企业提供强大的综合型数字化运作解决方案。",
      "longDescription": "这是一个能将客户的互动、数据分析及运营中心有机融合在一个流畅用户界面里的全栈化平台系统，为需要清晰、快速处理业务的扩张期企业带来强有力的护航体系。",
      "category": "Web 应用",
      "challenge": "客户曾受到多达十几个工具的数据墙限制，这拖慢了他们的脚步。他们需要打造一个内部无缝隙的平台系统来承载各项特定的功能环境。",
      "solution": "为了实现这一目标，我们使用了微前端分离架构结合实时的数据同步保障，并在外层为其套上了自然拟物、毫不费力的流畅交互界面设计，让极其复杂的内部工作流从感知上变得极其简单自然。",
      "impact": "在投入运行的首个季度内，这个系统为他们减少了足足大约 60% 的营运开销压力，并且促进整个部门团队的业务产出效率狂飙了总计 3 倍。",
      "techStack": ["React", "Node.js", "GraphQL", "Redis", "AWS"],
      "metric": "3x",
      "metricLabel": "交付速度倍率"
    },
    "p2": {
      "title": "灵动仪表盘",
      "description": "带有深度沉浸式探索体验的全新分析看板体系。",
      "longDescription": "一个可将冰冷无序的杂乱基础原始数据一举变身成为富有活力的灵动交互式图表矩阵看板系统。在此系统中，用户在面对海量数据时，也能获得一种仿佛像是探索未知新海域的航海家般的愉悦感和自然感。",
      "category": "仪表盘",
      "challenge": "从往常陈旧不堪、密密麻麻的静态报表和数据大屏来看，用户已经产生枯燥和眼花的严重疲劳感。客户渴望这种探索不再成为阻力和难题，希望能为其员工提供直觉化及赏心悦目的新感受。",
      "solution": "得益于先进理念与技术栈系统支持下，我们将手势直接加入了数据报表控件的联动响应网，它既能敏锐洞悉使用者的操作逻辑自适应适配最佳浏览排布，又能化生极具视觉张力和水流呼吸感般的舒展变化体系来主动给用户提供洞见信息。",
      "impact": "使用者愿意去接触和把玩仪表系统来进行分析的行为与频率大幅增加了足足有 240% ，在此同时每次进行相关行为获取有效数据指标结果与洞察线索所花费的耗时从之前夸张的 15 分钟彻底压缩到仅有可喜的 3 分钟以内。",
      "techStack": ["Vue.js", "D3.js", "Python", "PostgreSQL", "Docker"],
      "metric": "50K+",
      "metricLabel": "当前活跃人数"
    },
    "p3": {
      "title": "拟物经典移动端",
      "description": "重新定义下一代移动端界面该有的模样。",
      "longDescription": "用具有立体深度感官和剔透虚化朦胧特性的质地，配合其极其丝滑生动的灵动式动效，一起带来真正意义上极力突破应用呈现与感受极限的划时代手机端产品先锋体系。",
      "category": "移动端",
      "challenge": "过去老态龙钟、古板沉闷加上让人难以下手使用的复杂传统操作布局与生硬粗糙体验，使得用户在使用之初的新手引导阶段便选择了逃离和放弃。",
      "solution": "通过拟物玻璃形态设计（Glassmorphism）、触觉引擎（haptic feedback patterns）来引入极其微妙的交互体感以及层层递进逐步揭露隐藏复杂信息的高级展示技巧系统，我们全面颠覆并且再塑了整个 UI 用户体验基础结构并保障了简易而优雅的特点且绝不会损失原本专业层面的深层架构功能。",
      "impact": "这极大力度地扭转了 App Store 过往可怜的 3.2 星惨淡低分并在重新上架后直接以极其亮眼的 4.9 颗星的高评获得了口碑层面的涅槃与新生。并且对于该体系的新手入门引导阶段其完整完成转化留存的比重直接拔高了高达令人瞩目的 85% 。",
      "techStack": ["Swift", "SwiftUI", "Firebase", "Lottie", "CoreData"],
      "metric": "4.9★",
      "metricLabel": "App Store 评分"
    },
    "p4": {
      "title": "量子网络",
      "description": "用极其模糊且又高度写实且充满未来实验主义感的理念重新打破虚幻与可交互数字环境间的藩篱。",
      "longDescription": "这是一个采用了在 2D 大屏或者手机小屏环境空间上，巧妙加入各种视觉差异等极高手段运用动画，营造并实现如同真实 3D 三维环境般的，饱含实验性质的前沿创新网站平台系统案例实景方案验证模型演示。",
      "category": "品牌构建",
      "challenge": "过去要体现其线下那种奢靡、高端、无与伦比的极尽享受体验时，客户迫切要求并期望只要通过用户手里任意的一套具有普通的、符合网页标准的访问条件的电子终端也可以通过云端体验的方式让所有群体都可以切身并且直观感受到如同置身其线下那些实体环境空间一样那份极致感与品牌气场。",
      "solution": "为了实现极高真实感以及空间沉浸程度，我们不但深度调用并利用开发了 WebGL、各种特殊可编程高度优化的自定义着色系统（shaders），还辅以滚动控制反馈驱动（scroll-driven animations）以使其可以实现依据感应获取当前的访问端设备在用户空间之内的倾斜水平感应信息甚至是人机之间互相相对物理空间上的接近或远离判定信息并用在画面实时处理呈现上的先进交互机制与呈现。",
      "impact": "品牌方收获了无上盛赞和关注，整体转化等核心价值与各项指数表现获得长足进步以及直接增长翻至到了极度夸张的足足 200% 水位，其平均停留市场实现了三倍速扩增。除此之外在业界也获得广泛极高嘉奖，拿下了三个业界最具指标意义代表极高实力的荣誉 Awwwards Site of the Day 大奖。",
      "techStack": ["Three.js", "GSAP", "WebGL", "Astro", "Cloudflare"],
      "metric": "200%",
      "metricLabel": "品牌关注提升度"
    },
    "p5": {
      "title": "神经网络式数字业务自运转信息工作流体系",
      "description": "针对各种艺术设计及一切拥有各类创作业务及流转属性团队深度优化打造的基于先进的生成式与自然语意理解 AI 集成技术下放的应用方案体系网络集群自动流平台载体案例。",
      "longDescription": "提供的一套会具有自身可进化并在日积月累潜移默化自学习、根据不同人具有的行为习性的差异来进行适应的一套自纠错化方案工具集群集。它会悄无声息并在需要它的时候出面对那些重复、烦劳且并不必要牵扯创作者大量珍贵精力的文件迭代管理追踪归类等过程来进行化解处理——让他们只需要去单纯关注创作本身即是唯一的事。",
      "category": "Web 应用",
      "challenge": "各类有着艺术创造属性方向或者公司工作室他们被沉重的管理机制负累导致其白白将几乎约合有着高昂报酬成本可换取产值的属于业务与账单时间中的足足近 30% 被这种低等、反复以及容易发错引起各种协作冲突的管理等行为被残忍剥夺。",
      "solution": "直接构建并在其内部嵌套一层 AI 中控逻辑作为大脑并使其承担整个流转审核预判执行以及诸如以自动标记生成差异并做版本识别化解工作（visual diff）。配合没有干扰的简单系统环境帮助使用者解放大脑集中于当下任务创作焦点目标本身。",
      "impact": "直接有效解放每一层系统节点内包含员工乃至相关责任人员们每星期间能有宝贵可支配多达十二个有余的时段可用来发掘以及投入更为高级事务之工作。其各项相关项目的耗时大幅急剧度骤降压缩乃至节省掉高达总计比例的 40% 左右的时间资源去获取最后交付成效与价值变现代出量结果产生能力保障。",
      "techStack": ["Next.js", "OpenAI", "Prisma", "Supabase", "Vercel"],
      "metric": "40%",
      "metricLabel": "提速降本节省率"
    },
    "p6": {
      "title": "棱镜数字商业",
      "description": "包含高度身临其境感受与可玩可体验形式作为核心展示特性的具有次时代电子商务概念属性的应用展现产品。",
      "longDescription": "采取前沿且极致且充满想象与完全超脱摆脱传统概念约束形式设计构建的新一代去后端中心化纯响应业务体系的电商产品。当用户看到其陈列体系内物品那刻起他便已不再像传统那样看着呆板照片而像是正触摸及赏析一个可以由 3D 构成或由真实所处环境中的 AR 实现展现出的实物投影模型。伴随着这种特性并时刻具有依托用户兴趣标签随即在访问当时时刻完成组建构成的定制化商品展现网络大系统界面布局机制模型服务支撑保障环境等等。",
      "category": "仪表盘",
      "challenge": "面临长期停滞无法有效增涨打破只具有区区极为惨淡可悲不足 2.1%的购买转化死结窘境问题难题表现。当用户如果无法能够亲自能够拥有去确信了解高价值的实物其自身拥有何等优秀工艺价值乃至各种感知反馈和触摸把握确切情况而就此选择放弃不再愿意消费甚至进一步接触和理解。",
      "solution": "直接无缝无摩擦直接引如诸如真正的无须依赖任何其他单独或者独立载体便可以以一种最为轻量方式被拉起访问交互运行使用实现诸如 WebXR 技术来达到并且将购物这一整条相关从最初阶段直到发生并最终确认结束达成一切路径链条通通实现通过最具有减少流失优势机制的单一动作按键触控闭合回路操作设计方法加以贯通到底（one-tap checkout flow）。",
      "impact": "转化订单成单比例数字数据不仅发生了翻天覆地直接破除屏障般火箭升空般拔升翻倍直接跨级暴走增长到拥有夸张傲人的 5.8% 成绩以外。每张单独成立的采购大单内包含最终含价值总额其数量不仅获得攀升也增长了超越三成拥有之巨达令人满意的 35% 左右，并且相关对于各种买后因各类不满产生退去及退货问题更是因此直接暴跌至直接被斩落对半切去减半后的超稳数字规模水平保障程度安全红线阈值成绩记录以内极值水平区间内状态运行情况呈现状态之中且稳定发挥运转能力保障。",
      "techStack": ["Remix", "Shopify Hydrogen", "Three.js", "Stripe", "Edge Functions"],
      "metric": "176%",
      "metricLabel": "成单提升爆改增量"
    }
  }
}
