{
  "pageTitle": "Наши работы",
  "pageSubtitle": "Коллекция цифровых решений, созданных с точностью, глубиной и плавностью взаимодействия.",
  "backToHome": "На главную",
  "filterAll": "Все",
  "viewDetails": "Подробнее",
  "closeDetails": "Закрыть",
  "theChallenge": "Задача",
  "theSolution": "Решение",
  "theImpact": "Результат",
  "techStackLabel": "Технологии",
  "startProject": "Начать проект",
  "startProjectSub": "Готовы воплотить вашу идею?",
  "comingSoon": "Эта страница портфолио скоро появится.",
  "projects": {
    "p1": {
      "title": "Цифровая Экосистема",
      "description": "Комплексное решение для современных стартапов.",
      "longDescription": "Полноценная цифровая платформа, объединяющая взаимодействие с клиентами, аналитику и операции в единый интерфейс. Создана для компаний, требующих ясности на скорости.",
      "category": "Веб-приложение",
      "challenge": "Клиенту нужно было объединить 12 отдельных инструментов в одну платформу, не теряя функциональности каждого.",
      "solution": "Мы создали модульную микро-фронтенд архитектуру с синхронизацией в реальном времени и органичным интерфейсом.",
      "impact": "Операционные расходы сократились на 60%, а скорость работы команды выросла в 3 раза за первый квартал.",
      "techStack": ["React", "Node.js", "GraphQL", "Redis", "AWS"],
      "metric": "3x",
      "metricLabel": "Быстрее доставка"
    },
    "p2": {
      "title": "Liquid Dashboard",
      "description": "Аналитика с глубоким погружением в данные.",
      "longDescription": "Панель аналитики, превращающая сырые данные в текучие, интерактивные визуализации. Пользователи исследуют данные как первооткрыватели.",
      "category": "Дашборд",
      "challenge": "Традиционные дашборды перегружали пользователей статичными графиками. Клиент хотел сделать работу с данными интуитивной.",
      "solution": "Мы спроектировали жестовые визуализации данных с адаптивными макетами, которые реагируют на поведение пользователя.",
      "impact": "Вовлечённость пользователей выросла на 240%, а среднее время до инсайта сократилось с 15 минут до 3.",
      "techStack": ["Vue.js", "D3.js", "Python", "PostgreSQL", "Docker"],
      "metric": "50K+",
      "metricLabel": "Активных пользователей"
    },
    "p3": {
      "title": "Glassic Mobile",
      "description": "Новое слово в мобильных интерфейсах.",
      "longDescription": "Мобильный опыт, раздвигающий границы нативных приложений. Глубина, прозрачность и движение создают интерфейс, который дышит.",
      "category": "Мобильное",
      "challenge": "Существующее приложение выглядело устаревшим. Пользователи уходили на этапе онбординга из-за сложности интерфейса.",
      "solution": "Мы полностью перестроили UX с glassmorphism дизайн-системой, тактильной обратной связью и прогрессивным раскрытием.",
      "impact": "Рейтинг в App Store вырос с 3.2 до 4.9 звёзд, а завершение онбординга увеличилось на 85%.",
      "techStack": ["Swift", "SwiftUI", "Firebase", "Lottie", "CoreData"],
      "metric": "4.9★",
      "metricLabel": "Рейтинг App Store"
    },
    "p4": {
      "title": "Quantum Web",
      "description": "Стирая грань между реальностью и интерфейсом.",
      "longDescription": "Экспериментальная веб-платформа с продвинутыми анимациями и пространственным дизайном, создающая трёхмерные ощущения на двумерном экране.",
      "category": "Брендинг",
      "challenge": "Бренду нужно было цифровое присутствие уровня их физических магазинов, но доступное любому с браузером.",
      "solution": "Мы использовали WebGL, scroll-анимации и кастомные шейдеры для создания пространственного веб-опыта.",
      "impact": "Вовлечённость бренда выросла на 200%, длительность сессий утроилась, сайт получил 3 награды Awwwards.",
      "techStack": ["Three.js", "GSAP", "WebGL", "Astro", "Cloudflare"],
      "metric": "200%",
      "metricLabel": "Рост вовлечённости"
    },
    "p5": {
      "title": "Neural Flow",
      "description": "AI-автоматизация рабочих процессов для креативных команд.",
      "longDescription": "Интеллектуальная платформа, которая учится на поведении команды и автоматизирует рутинные задачи, позволяя дизайнерам фокусироваться на главном.",
      "category": "Веб-приложение",
      "challenge": "Креативные агентства теряли 30% оплачиваемых часов на управление проектами и конфликты версий файлов.",
      "solution": "Мы создали AI-слой, предсказывающий зависимости, маршрутизирующий согласования и управляющий версиями с визуальным diff.",
      "impact": "Команды экономят в среднем 12 часов в неделю на дизайнера, сроки проектов сократились на 40%.",
      "techStack": ["Next.js", "OpenAI", "Prisma", "Supabase", "Vercel"],
      "metric": "40%",
      "metricLabel": "Быстрее доставка"
    },
    "p6": {
      "title": "Prism Commerce",
      "description": "E-commerce нового поколения с иммерсивным исследованием продуктов.",
      "longDescription": "Headless-платформа, где продукты оживают через 3D-превью, AR-примерку и адаптивные витрины, персонализирующиеся в реальном времени.",
      "category": "Дашборд",
      "challenge": "Конверсия застопорилась на 2.1%. Клиенты не могли получить уверенность для покупки премиальных товаров онлайн.",
      "solution": "Мы интегрировали WebXR превью продуктов, персонализацию в реальном времени и checkout в одно касание.",
      "impact": "Конверсия выросла до 5.8%, средний чек увеличился на 35%, возвраты сократились вдвое.",
      "techStack": ["Remix", "Shopify Hydrogen", "Three.js", "Stripe", "Edge Functions"],
      "metric": "176%",
      "metricLabel": "Рост конверсии"
    }
  }
}
