{
  "title": "Политика конфиденциальности",
  "lastUpdated": "Последнее обновление: Февраль 2026",
  "description": "Узнайте, как мы собираем, используем и защищаем ваши данные в Astroglass.",
  "sections": {
    "intro": {
      "content": "Добро пожаловать в Astroglass. Мы уважаем вашу конфиденциальность и стремимся защитить ваши личные данные. Эта политика конфиденциальности информирует вас о том, как мы обрабатываем ваши личные данные при посещении нашего сайта, а также о ваших правах на конфиденциальность и о том, как закон защищает вас."
    },
    "collection": {
      "title": "Информация, которую мы собираем",
      "content": "Мы можем собирать, использовать, хранить и передавать различные виды персональных данных о вас, которые мы сгруппировали следующим образом: Данные идентификации, Контактные данные, Технические данные и Данные об использовании. Мы не собираем специальные категории персональных данных о вас."
    },
    "usage": {
      "title": "Как мы используем вашу информацию",
      "content": "Мы будем использовать ваши персональные данные только тогда, когда это разрешено законом. Чаще всего мы будем использовать ваши персональные данные в следующих обстоятельствах: Когда нам необходимо выполнить контракт, который мы собираемся заключить или уже заключили с вами. Когда это необходимо для наших законных интересов (или интересов третьей стороны), и ваши интересы и основные права не отменяют эти интересы."
    },
    "sharing": {
      "title": "Раскрытие ваших персональных данных",
      "content": "Мы можем передавать ваши персональные данные сторонам, указанным ниже, для целей, указанных в таблице выше: Внутренние третьи стороны, Внешние третьи стороны (например, Cloudflare) и Третьи стороны, которым мы можем продать, передать или объединить часть нашего бизнеса или наших активов."
    },
    "security": {
      "title": "Безопасность данных",
      "content": "Мы приняли надлежащие меры безопасности, чтобы предотвратить случайную потерю, использование или доступ к вашим персональным данным несанкционированным образом, их изменение или раскрытие. Кроме того, мы ограничиваем доступ к вашим персональным данным теми сотрудниками, агентами, подрядчиками и другими третьими сторонами, у которых есть служебная необходимость знать."
    },
    "cookies": {
      "title": "Файлы Cookie",
      "content": "Вы можете настроить свой браузер так, чтобы он отказывался от всех или некоторых файлов cookie браузера или предупреждал вас, когда веб-сайты устанавливают или получают доступ к файлам cookie. Если вы отключите или откажетесь от использования файлов cookie, обратите внимание, что некоторые части этого веб-сайта могут стать недоступными или работать неправильно."
    },
    "rights": {
      "title": "Ваши законные права",
      "content": "При определенных обстоятельствах у вас есть права в соответствии с законами о защите данных в отношении ваших персональных данных, включая право запрашивать доступ, исправление, удаление, ограничение, передачу, возражение против обработки, переносимость данных и (в случае, если законным основанием обработки является согласие) отозвать согласие."
    },
    "contact": {
      "title": "Связаться с нами",
      "content": "Если у вас есть вопросы о данной политике конфиденциальности или наших методах обеспечения конфиденциальности, пожалуйста, свяжитесь с нами по адресу: support@example.com."
    }
  }
}
