{
  "title": "Условия и положения",
  "lastUpdated": "Последнее обновление: Февраль 2026",
  "description": "Ознакомьтесь с нашими условиями использования сервисов Astroglass.",
  "sections": {
    "intro": {
      "title": "Введение",
      "content": "Добро пожаловать в Astroglass! Эти условия и положения описывают правила и предписания для использования веб-сайта Astroglass. Получая доступ к этому веб-сайту, мы предполагаем, что вы принимаете эти условия и положения. Не продолжайте использовать Astroglass, если вы не согласны принять все условия и положения, изложенные на этой странице."
    },
    "license": {
      "title": "Лицензия",
      "content": "Если не указано иное, Astroglass и/или его лицензиары владеют правами на интеллектуальную собственность для всех материалов на Astroglass. Все права на интеллектуальную собственность защищены. Вы можете получить доступ к этому с Astroglass для личного использования с учетом ограничений, установленных в этих условиях и положениях."
    },
    "restrictions": {
      "title": "Ограничения",
      "content": "Вам специально запрещено все следующее: публикация любых материалов веб-сайта в любых других медиа; продажа, сублицензирование и/или иная коммерциализация любых материалов веб-сайта; публичное исполнение и/или показ любых материалов веб-сайта; использование этого веб-сайта любым способом, который наносит или может нанести ущерб этому веб-сайту."
    },
    "content": {
      "title": "Ваш контент",
      "content": "В настоящих Стандартных условиях использования веб-сайта «Ваш контент» означает любой аудио, видео текст, изображения или другие материалы, которые вы решите отобразить на этом веб-сайте. Отображая Ваш контент, вы предоставляете Astroglass неисключительную, всемирную безотзывную, сублицензируемую лицензию на использование, воспроизведение, адаптацию, публикацию, перевод и распространение его в любых и всех медиа."
    },
    "privacy": {
      "title": "Ваша конфиденциальность",
      "content": "Пожалуйста, прочитайте нашу Политику конфиденциальности."
    },
    "warranties": {
      "title": "Отсутствие гарантий",
      "content": "Этот веб-сайт предоставляется «как есть», со всеми недостатками, и Astroglass не выражает никаких заявлений или гарантий любого рода, связанных с этим веб-сайтом или материалами, содержащимися на этом веб-сайте."
    },
    "liability": {
      "title": "Ограничение ответственности",
      "content": "Ни при каких обстоятельствах Astroglass, ни кто-либо из его должностных лиц, директоров и сотрудников не несет ответственности за что-либо, возникающее из или каким-либо образом связанное с вашим использованием этого веб-сайта, будь то ответственность по договору. Astroglass, включая его должностных лиц, директоров и сотрудников, не несет ответственности за любую косвенную, последующую или специальную ответственность, возникающую из или каким-либо образом связанную с вашим использованием этого веб-сайта."
    },
    "indemnification": {
      "title": "Возмещение убытков",
      "content": "Вы настоящим возмещаете Astroglass в максимальной степени от и против любых и/или всех обязательств, расходов, требований, причин иска, убытков и расходов, возникающих любым способом, связанным с вашим нарушением любого из положений настоящих Условий."
    },
    "severability": {
      "title": "Автономность положений",
      "content": "Если какое-либо положение настоящих Условий будет признано недействительным в соответствии с любым применимым законодательством, такие положения будут удалены, не затрагивая остальные положения настоящего документа."
    },
    "variation": {
      "title": "Изменение условий",
      "content": "Astroglass имеет право пересматривать настоящие Условия в любое время по своему усмотрению, и, используя этот Веб-сайт, вы должны регулярно просматривать настоящие Условия."
    },
    "governing": {
      "title": "Применимое право и юрисдикция",
      "content": "Настоящие Условия регулируются и толкуются в соответствии с законами штата Страны, и вы подчиняетесь неисключительной юрисдикции судов штата и федеральных судов, расположенных в Стране, для разрешения любых споров."
    }
  }
}
